#+TITLE: IMF Language Specification
#+DATE: Editor: Martin G. Skjæveland
#+AUTHOR:
#+EMAIL:

#+OPTIONS: ':nil *:t -:t ::t <:t H:4 \n:nil ^:t arch:headline
#+OPTIONS: author:t broken-links:nil c:nil creator:nil
#+OPTIONS: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+OPTIONS: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+OPTIONS: timestamp:t title:t toc:t todo:t |:t
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport QA update old
#+EXPORT_FILE_NAME: index.html

#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [12pt]
#+LATEX_HEADER: \usepackage{fullpage,parskip,times}
#+LATEX_HEADER: \usepackage{xcolor}
#+LATEX_HEADER: \usepackage[zerostyle=d]{newtxtt} %% Various versions of zeros available. See documentation for details

**** Processing                                                          :QA:

#+NAME: py_aspectelement_interaspect_rels
#+BEGIN_SRC python :var table=tbl-aspects :exports none
output = ""

for row in table:
  aspect = row[0].replace("imf:","").replace("Aspect", "").capitalize()
  color = row[2].replace("'","").replace("#","")

  ae = aspect + "Element"

  output += "class " + ae + " #back:" + color + "\n"
  output += "AspectElement --> " + ae + " : as" + aspect + "\n"
  output += "AspectElement <|-- " + ae + " \n"

return output
#+END_SRC

#+RESULTS: py_aspectelement_interaspect_rels
#+begin_example
class FunctionElement #back:FFFF00
AspectElement --> FunctionElement : asFunction
AspectElement <|-- FunctionElement
class LocationElement #back:FF00FF
AspectElement --> LocationElement : asLocation
AspectElement <|-- LocationElement
class ProductElement #back:00FFFF
AspectElement --> ProductElement : asProduct
AspectElement <|-- ProductElement
class InstalledElement #back:0000FF
AspectElement --> InstalledElement : asInstalled
AspectElement <|-- InstalledElement
#+end_example


#+NAME: py_aspectelement_subs
#+BEGIN_SRC python :var table=tbl-aspects :exports none
output = ""

for row in table:
  aspect = row[0].replace("imf:","").replace("Aspect", "").capitalize()
  color = row[2].replace("'","").replace("#","")

  for element in ['Block', 'Terminal']:
    ae = aspect + element

    output += "class " + ae + " #back:" + color + "\n"
    output += element + " <|-- " + ae + "\n"
    output += aspect + "Element <|-- " + ae + "\n"

output += "\n"
return output
#+END_SRC

#+RESULTS: py_aspectelement_subs
#+begin_example
class FunctionBlock #back:FFFF00
Block <|-- FunctionBlock
FunctionElement <|-- FunctionBlock
class FunctionTerminal #back:FFFF00
Terminal <|-- FunctionTerminal
FunctionElement <|-- FunctionTerminal
class LocationBlock #back:FF00FF
Block <|-- LocationBlock
LocationElement <|-- LocationBlock
class LocationTerminal #back:FF00FF
Terminal <|-- LocationTerminal
LocationElement <|-- LocationTerminal
class ProductBlock #back:00FFFF
Block <|-- ProductBlock
ProductElement <|-- ProductBlock
class ProductTerminal #back:00FFFF
Terminal <|-- ProductTerminal
ProductElement <|-- ProductTerminal
class InstalledBlock #back:0000FF
Block <|-- InstalledBlock
InstalledElement <|-- InstalledBlock
class InstalledTerminal #back:0000FF
Terminal <|-- InstalledTerminal
InstalledElement <|-- InstalledTerminal
#+end_example

*** Standard vocabulary prefixes

#+NAME: prefixes-std
#+BEGIN_SRC ttl :tangle out/.std-prefixes.ttl
@prefix xsd:	<http://www.w3.org/2001/XMLSchema#> .
@prefix rdf:	<http://www.w3.org/1999/02/22-rdf-syntax-ns#> .
@prefix rdfs:	<http://www.w3.org/2000/01/rdf-schema#> .
@prefix owl:    <http://www.w3.org/2002/07/owl#> .
@prefix sh:	<http://www.w3.org/ns/shacl#> .

@prefix dc:	<http://purl.org/dc/elements/1.1/> .
@prefix foaf:   <http://xmlns.com/foaf/0.1/> .
@prefix pav:	<http://purl.org/pav/> .
@prefix skos:	<http://www.w3.org/2004/02/skos/core#> .
@prefix vann:   <http://purl.org/vocab/vann/> .
@prefix vs:     <http://www.w3.org/2003/06/sw-vocab-status/ns#> .

@prefix ex:	<http://example.com#> .
#+END_SRC

#+RESULTS: prefixes-std
#+begin_example
@prefix xsd:	<http://www.w3.org/2001/XMLSchema#> .
@prefix rdf:	<http://www.w3.org/1999/02/22-rdf-syntax-ns#> .
@prefix rdfs:	<http://www.w3.org/2000/01/rdf-schema#> .
@prefix owl:    <http://www.w3.org/2002/07/owl#> .
@prefix sh:	<http://www.w3.org/ns/shacl#> .
@prefix shsh:   <http://www.w3.org/ns/shacl-shacl#> .

@prefix skos:	<http://www.w3.org/2004/02/skos/core#> .
@prefix pav:	<http://purl.org/pav/> .
@prefix vs:     <http://www.w3.org/2003/06/sw-vocab-status/ns#> .
@prefix vann:   <http://purl.org/vocab/vann/> .
@prefix foaf:   <http://xmlns.com/foaf/0.1/> .

@prefix imf:	<http://ns.imfid.org/imf#> .
@prefix ex:	<http://example.com#> .
#+end_example

*** All prefixes combined                                          :noexport:

#+NAME: prefixes
#+BEGIN_SRC ttl :noweb yes
<<prefixes-imf>>

<<prefixes-ottr>>
#+END_SRC

#+RESULTS: prefixes
#+begin_example
@prefix xsd:	<http://www.w3.org/2001/XMLSchema#> .
@prefix rdf:	<http://www.w3.org/1999/02/22-rdf-syntax-ns#> .
@prefix rdfs:	<http://www.w3.org/2000/01/rdf-schema#> .
@prefix owl:    <http://www.w3.org/2002/07/owl#> .
@prefix skos:	<http://www.w3.org/2004/02/skos/core#> .
@prefix pav:	<http://purl.org/pav/> .
@prefix sh:	<http://www.w3.org/ns/shacl#> .
@prefix shsh:   <http://www.w3.org/ns/shacl-shacl#> .
@prefix ex:	<http://example.com#> .
@prefix imf:	<http://ns.imfid.org/imf#> .

@prefix p14:    <http://example.com/P14#> .
@prefix ottr:        <http://ns.ottr.xyz/0.4/> .
@prefix o-rdf:       <http://tpl.ottr.xyz/rdf/0.1/> .
@prefix o-rdfs:       <http://tpl.ottr.xyz/rdfs/0.2/> .
@prefix o-owl-ax:    <http://tpl.ottr.xyz/owl/axiom/0.1/> .
@prefix o-owl-ma:    <http://tpl.ottr.xyz/owl/macro/0.1/> .
@prefix o-owl-rstr:  <http://tpl.ottr.xyz/owl/restriction/0.1/> .

@prefix o-imf:	     <http://ns.imfid.org/templates/> .
@prefix o-imf-t-s:   <http://ns.imfid.org/templates/type/shacl/> .
#+end_example

#+NAME: py_prefixes_sparql
#+BEGIN_SRC python :var prefixes=prefixes
output = ""

for p in prefixes.split("\n"):
  output += p.replace("@","").strip().strip(".") + "\n"

return output
#+END_SRC

#+RESULTS: py_prefixes_sparql
#+begin_example
prefix xsd:	<http://www.w3.org/2001/XMLSchema#>
prefix rdf:	<http://www.w3.org/1999/02/22-rdf-syntax-ns#>
prefix rdfs:	<http://www.w3.org/2000/01/rdf-schema#>
prefix owl:    <http://www.w3.org/2002/07/owl#>
prefix skos:	<http://www.w3.org/2004/02/skos/core#>
prefix pav:	<http://purl.org/pav/>
prefix sh:	<http://www.w3.org/ns/shacl#>
prefix shsh:   <http://www.w3.org/ns/shacl-shacl#>
prefix ex:	<http://example.com#>
prefix imf:	<http://ns.imfid.org/imf#>

prefix p14:    <http://example.com/P14#>
prefix ottr:        <http://ns.ottr.xyz/0.4/>
prefix o-rdf:       <http://tpl.ottr.xyz/rdf/0.1/>
prefix o-rdfs:       <http://tpl.ottr.xyz/rdfs/0.2/>
prefix o-owl-ax:    <http://tpl.ottr.xyz/owl/axiom/0.1/>
prefix o-owl-ma:    <http://tpl.ottr.xyz/owl/macro/0.1/>
prefix o-owl-rstr:  <http://tpl.ottr.xyz/owl/restriction/0.1/>

prefix o-imf:	     <http://ns.imfid.org/templates/>
prefix o-imf-t-s:   <http://ns.imfid.org/templates/type/shacl/>
#+end_example




*** RIOT

Reading, writing and validating RDF.

#+BEGIN_SRC sh :results output verbatim
bin/apache-jena/bin/riot --help
#+END_SRC

#+RESULTS:
#+begin_example
riot [--help] [--time] [--base=IRI] [-syntax=FORMAT] [--out=FORMAT] [--count] file ...
  Parser control
      --sink                 Parse but throw away output
      --syntax=NAME          Set syntax (otherwise syntax guessed from file extension)
      --base=URI             Set the base URI (does not apply to N-triples and N-Quads)
      --check                Additional checking of RDF terms
      --strict               Run with in strict mode
      --validate             Same as --sink --check --strict
      --count                Count triples/quads parsed, not output them
      --rdfs=file            Apply some RDFS inference using the vocabulary in the file
      --nocheck              Turn off checking of RDF terms
  Output control
      --output=FMT           Output in the given format, streaming if possible.
      --formatted=FMT        Output, using pretty printing (consumes memory)
      --stream=FMT           Output, using a streaming format
      --compress             Compress the output with gzip
  Time
      --time                 Time the operation
  Symbol definition
      --set                  Set a configuration symbol to a value
  General
      -v   --verbose         Verbose
      -q   --quiet           Run with minimal output
      --debug                Output information for debugging
      --help
      --version              Version information
#+end_example

#+NAME: sh_jena_validate_rdf
#+BEGIN_SRC sh :results output verbatim :var syntax="TTL" :var files="out/owl/imf-ontology.owl.ttl"
bin/apache-jena/bin/riot --verbose --syntax=$syntax --validate --time $files
#+END_SRC

#+RESULTS: sh_jena_validate_rdf
: file:///home/martige/repo/imf-lab/imf-ontology/out/owl/imf-ontology.owl.ttl : 0.22 sec : 494 Triples : 2,235.29 per second

#+NAME: sh_jena_merge
#+BEGIN_SRC sh :results output verbatim :var syntax="TTL" :var files="out/owl/imf-elements.owl.ttl out/owl/imf-attributes.owl.ttl" :var out="out/owl/imf-ontology.owl.ttl"
bin/apache-jena/bin/riot --verbose --syntax=$syntax --check --time $files > $out
#+END_SRC

#+RESULTS: sh_jena_merge
: 08:47:29 INFO  riot            :: File: out/owl/imf-elements.owl.ttl
: file:///home/martige/repo/imf-lab/imf-ontology/out/owl/imf-elements.owl.ttl : 0.19 sec : 146 Triples : 768.42 per second
: 08:47:29 INFO  riot            :: File: out/owl/imf-attributes.owl.ttl
: file:///home/martige/repo/imf-lab/imf-ontology/out/owl/imf-attributes.owl.ttl : 0.02 sec : 140 Triples : 7,000.00 per second
: Total           : 0.21 sec : 286 Triples : 1,361.90 per second

*** SHACL

Validate RDF wrt. SHACL shapes.

#+BEGIN_SRC sh :results output verbatim
bin/apache-jena/bin/shacl v --help
#+END_SRC

#+RESULTS:
#+begin_example
shacl_validate [--target URI] --shapes shapesFile --data dataFile
  General
      -v   --verbose         Verbose
      -q   --quiet           Run with minimal output
      --debug                Output information for debugging
      --help
      --version              Version information
      --shapes               Shapes file
      --data                 Data file
      --target               Validate specific node [may use prefixes from the data]
      --text                 Output in concise text format
#+end_example

#+NAME: sh_jena_shacl_validate
#+BEGIN_SRC sh :results output raw :var shapes="shapefile" :var data="rdf-examples/coffee-machine.ttl" :wrap src ttl
for shape in $shapes 
do
  for dat in $data 
  do
    echo "Validating RDF data <$dat> against SHACL shape <$shape>:"
    bin/apache-jena/bin/shacl v --text --shapes $shape --data $dat
    echo
  done
done
#+END_SRC

#+NAME: sh_jena_shacl_std_validate
#+BEGIN_SRC sh :results output raw :var data="out/owl/imf-ontology.owl.ttl" :wrap src ttl
echo "Result of validating RDF data <$data> against SHACL shape <http://shipshape.dyreriket.xyz/std-vocabulary-elements.ttl>:\n"
bin/apache-jena/bin/shacl v --text --shapes http://shipshape.dyreriket.xyz/std-vocabulary-elements.ttl --data $data
#+END_SRC

#+RESULTS: sh_jena_shacl_std_validate
#+BEGIN_src ttl
Result of validating data <out/owl/imf-ontology.owl.ttl> against shape <http://shipshape.dyreriket.xyz/std-vocabulary-elements.ttl>:

Conforms
#+END_src

*** SPARQL

Query RDF.

#+BEGIN_SRC sh :results output verbatim
bin/apache-jena/bin/sparql --help
#+END_SRC

#+RESULTS:
#+begin_example
sparql --data=<file> --query=<query>
  Control
      --explain              Explain and log query execution
      --repeat=N or N,M      Do N times or N warmup and then M times (use for timing to overcome start up costs of Java)
      --optimize=            Turn the query optimizer on or off (default: on)
  Time
      --time                 Time the operation
  Query Engine
      --engine=EngineName    Register another engine factory[ref]
      --unengine=EngineName   Unregister an engine factory
  Dataset
      --data=FILE            Data for the dataset - triple or quad formats
      --graph=FILE           Graph for default graph of the datset
      --namedGraph=FILE      Add a graph into the dataset as a named graph
  Results
      --results=             Results format (Result set: text, XML, JSON, CSV, TSV; Graph: RDF serialization)
      --desc=                Assembler description file
  Query
      --query, --file        File containing a query
      --syntax, --in         Syntax of the query
      --base                 Base URI for the query
  Symbol definition
      --set                  Set a configuration symbol to a value
  General
      -v   --verbose         Verbose
      -q   --quiet           Run with minimal output
      --debug                Output information for debugging
      --help
      --version              Version information
      --strict               Operate in strict SPARQL mode (no extensions of any kind)
#+end_example


#+NAME: sh_jena_sparql
#+BEGIN_SRC sh :results output :var query="PREFIX imf: <http://ns.imfid.org/imf#> SELECT * {?s ?p ?o} LIMIT 1" :var files="out/owl/imf-ontology.owl.ttl" :hlines yes :exports both
echo "$query" > out/temp/.temp-sh_jena_sparql
bin/apache-jena/bin/sparql --results=text --data=$files --query out/temp/.temp-sh_jena_sparql
#+END_SRC

#+RESULTS: sh_jena_sparql
: ---------------------------------------------------------------------------------------------------------------
: | s    | p                                                 | o                                                |
: ===============================================================================================================
: | _:b0 | <http://www.w3.org/1999/02/22-rdf-syntax-ns#rest> | <http://www.w3.org/1999/02/22-rdf-syntax-ns#nil> |
: ---------------------------------------------------------------------------------------------------------------

** Lutra

Lutra is the reference implementation for working with OTTR templates
and instances.

This section contains the scripts that are used to expand the OTTR
instances found in this document.

#+BEGIN_SRC sh
cd bin
wget -O lutra.jar -nc -x http://ottr.xyz/downloads/lutra/lutra-master.jar
#+END_SRC

#+RESULTS:

#+NAME: lutra-help
#+BEGIN_SRC sh :results output verbatim
java -jar bin/lutra.jar --help
#+END_SRC

#+RESULTS: lutra-help
#+begin_example
Usage: lutra [-fhV] [--debugFullTrace] [--debugStackTrace] [--quiet] [--stdout]
	     [-F=<fetchFormat>] [--haltOn=<haltOn>] [-I=<inputFormat>]
	     [-L=<libraryFormat>] [-m=<mode>] [-o=<out>] [-O=<outputFormat>]
	     [-p=<prefixes>] [-e=<extensions>[,<extensions>...]]...
	     [-E=<ignoreExtensions>[,<ignoreExtensions>...]]...
	     [-l=<library>]... [<inputs>...]

DESCRIPTION:
Reference implementation for OTTR Templates. Use for expanding template
instances and template definitions, translating between different formats and
for checking the integrity of template libraries.

PARAMETERS:
      [<inputs>...]         Files of instances to which operations are to be
			      applied.

OPTIONS:
      --debugFullTrace      This enables tracing such that printed messages get
			      a stack trace giving more information on the
			      location of the concerned objects. NB! Enabling
			      this flag will deteriorate performance.
			    default: false)
      --debugStackTrace     This enables printing a regular java stack trace
			      for error messages.Enabling this flag will not
			      deteriorate performance.
			    default: false)
  -e, --extension=<extensions>[,<extensions>...]
			    File extension of files to use as input to template
			      library.
			    (default: [])
  -E, --ignoreExtension=<ignoreExtensions>[,<ignoreExtensions>...]
			    File extensions of files to ignore as input to
			      template library.
			    (default: [])
  -f, --fetchMissing        Fetch missing template dependencies. It is here
			      assumed that templates' definitions are
			      accessible via their IRI, that is, the IRI is
			      either a path to a file, a URL, or similar.
			    (default: false)
  -F, --fetchFormat=<fetchFormat>
			    The input format of the templates fetched via the
			      -f flag.
  -h, --help                Show this help message and exit.
      --haltOn=<haltOn>     Halt execution upon receiving messages with a
			      severity equal to or greater than this value.
			    (legal values: INFO, WARNING, ERROR, FATAL;
			      default: ERROR)
  -I, --inputFormat=<inputFormat>
			    Input format of instances.
			    (legal values: wottr, stottr, tabottr, bottr
			      default: wottr)
  -l, --library=<library>   Folder containing templates to use as library. Can
			      be used multiple times for multiple libraries.
  -L, --libraryFormat=<libraryFormat>
			    The input format of the libraries. If omitted, all
			      available formats are attempted.
			    (legal values: wottr, stottr)
  -m, --mode=<mode>         The mode of operation to be applied to input.
			    (legal values: expand, expandLibrary, format,
			      formatLibrary, lint, checkSyntax, docttrLibrary;
			      default: expand)
  -o, --output=<out>        Path for writing output.
  -O, --outputFormat=<outputFormat>
			    Output format of output of operation defined by the
			      mode.
			    (legal values: wottr, stottr; default: wottr)
  -p, --prefixes=<prefixes> Path to RDF file containing prefix declarations to
			      be used when rendering output.    Any other data
			      in the file is read, but ignored.
      --quiet               Suppress all messages, including errors and
			      warnings.
			    (default: false)
      --stdout              Print system of operations to standard out.
			    (default: false)
  -V, --version             Print version information and exit.

LINKS:
Website:  https://ottr.xyz
Primers:  https://primer.ottr.xyz
Git repo: https://gitlab.com/ottr/lutra/lutra
#+end_example

#+NAME: lutra-expand
#+BEGIN_SRC sh :results output verbatim :var in="out/owl/imf-aspects.owl.wottr.ttl" :var inFormat="wottr" :var out="out/owl/imf-aspects.owl.ttl"
java -jar bin/lutra.jar -l out/ottr -L stottr -f -p out/.std-prefixes.ttl -I $inFormat -o $in.temp $in
rapper -i turtle -o turtle $in.temp > $out
rm $in.temp
#+END_SRC

#+RESULTS: lutra-expand
*** TODO Script calls

TODO: setup download

#+BEGIN_SRC sh :results output verbatim
java -jar bin/rdfvizler.jar --help
#+END_SRC

#+RESULTS:
#+begin_example

RDFVizler: RDF visualisation

Usage:
java -jar rdfvizler-[version].jar [--help] [--mergeInput] [--skipRules]
				  [--version]
				  [--inputFormatRDF=<inputFormatRDF>]
				  [--outputFormatRDF=<outputFormatRDF>]
				  [-i=<outputFormatImage>] [-r=<rules>]
				  [-x=<mode>] RDF_FILES...

Description:
RDFVizler visualises RDF by parsing a designated RDF RDFVizler vocabulary into
Graphviz syntax and processing this to a graph using Graphviz' dot software.
For more details, see http://rdfvizler.dyreriket.xyz.

Parameters:
      RDF_FILES...      Input RDF: URIs or file paths

Options:
  -x, --executionMode=<mode>
			What output to produce. (legal values: rdf, dot, image;
			  default: image)
  -r, --rules=<rules>   Input rules: URI or file path (default: http://rdfvizler.
			  dyreriket.xyz/rules/rdf.jrule)
      --skipRules       Skip rule application to input? (default: false)
      --inputFormatRDF=<inputFormatRDF>
			Format of RDF input (legal values: rdf, ttl, nt, guess;
			  default: guess -- by file extension as per jena.util.
			  FileUtils, then Turtle)
      --mergeInput      Merge input files to a single model to visualise?
      --outputFormatRDF=<outputFormatRDF>
			Format of RDF output (legal values: rdf, ttl, nt, guess;
			  default: rdf)
  -i, --outputFormatImage=<outputFormatImage>
			Format of image output (legal values: PNG, SVG,
			  SVG_STANDALONE, DOT, XDOT, PLAIN, PLAIN_EXT, PS, PS2,
			  JSON, JSON0, IMAP, CMAPX; default: SVG_STANDALONE)
      --version         Display version info
      --help            Display this help message
#+end_example


#+NAME: rdfvizler
#+BEGIN_SRC sh :results output verbatim :var rules="out/rdfvizler/import-hierarchy.rule" :var data="out/owl/imf-ontology.owl.ttl" :var output="out/.output-rdfvizler.svg"
java -jar bin/rdfvizler.jar --rules=$rules $data > $output
#+END_SRC

#+RESULTS: rdfvizler
#+begin_example
Exception in thread "main" picocli.CommandLine$ExecutionException: Error while running command (xyz.dyreriket.rdfvizler.cli.RDFVizlerCLI@66498326): org.apache.jena.shared.RulesetNotFoundException: out/rdfvizler/import-hierarchy.rule
	at picocli.CommandLine.execute(CommandLine.java:1056)
	at picocli.CommandLine.access$900(CommandLine.java:142)
	at picocli.CommandLine$RunLast.handle(CommandLine.java:1255)
	at picocli.CommandLine$RunLast.handle(CommandLine.java:1223)
	at picocli.CommandLine$AbstractParseResultHandler.handleParseResult(CommandLine.java:1131)
	at picocli.CommandLine.parseWithHandlers(CommandLine.java:1414)
	at picocli.CommandLine.run(CommandLine.java:1878)
	at picocli.CommandLine.run(CommandLine.java:1808)
	at xyz.dyreriket.rdfvizler.cli.RDFVizlerCLI.main(RDFVizlerCLI.java:133)
Caused by: org.apache.jena.shared.RulesetNotFoundException: out/rdfvizler/import-hierarchy.rule
	at org.apache.jena.reasoner.rulesys.Rule.rulesFromURL(Rule.java:511)
	at org.apache.jena.reasoner.rulesys.Rule.rulesFromURL(Rule.java:524)
	at xyz.dyreriket.rdfvizler.RDFVizler.getRules(RDFVizler.java:39)
	at xyz.dyreriket.rdfvizler.RDFVizler.getRDFDotModel(RDFVizler.java:72)
	at xyz.dyreriket.rdfvizler.RDFVizler.writeDotGraph(RDFVizler.java:105)
	at xyz.dyreriket.rdfvizler.RDFVizler.writeDotGraph(RDFVizler.java:111)
	at xyz.dyreriket.rdfvizler.RDFVizler.write(RDFVizler.java:99)
	at xyz.dyreriket.rdfvizler.cli.RDFVizlerCLI.processFile(RDFVizlerCLI.java:156)
	at xyz.dyreriket.rdfvizler.cli.RDFVizlerCLI.run(RDFVizlerCLI.java:166)
	at picocli.CommandLine.execute(CommandLine.java:1048)
	... 8 more
#+end_example

**** Viz rules
Work in process. Rule set for visualising IMF data.

#+BEGIN_SRC ttl :noweb yes :tangle out/rdfvizler/imf-data.rule :mkdirp yes
<<prefixes-rdfvizler>>

### GRAPH default settings
    [init:
	->
	(:graph rdf:type rvz:RootGraph)
	(:graph rdf:type rvz:DiGraph)
	(:graph rvz-a:rankdir "LR")
	//# (:graph rvz-a:nodesep "1")
	//# (:graph rvz-a:ranksep "1")
	(:graph rvz-a:center "true")
	(:graph rvz-a:overlap "true")
	//# (:graph rvz-a:splines "ortho")
	//# node defaults
	(:graph rvz-n:fontname "Arial")
	(:graph rvz-n:fontsize "11px")
	(:graph rvz-n:fixedsize "true")
	//# edge defaults
	(:graph rvz-e:fontname "Arial")
	(:graph rvz-e:fontsize "11px")
	]


    [classes:
	(?s rdf:type ?type)
	equalssome(?type, imf:Block imf:Terminal imf:ConnectionPoint)
	->
	(:graph rvz:hasNode ?s)
	]


    [triples:
	(?s ?p ?o)
	equalssome(?p, imf:hasPart, imf:hasTerminal, imf:connectedTo, imf:R)
	makeSkolem(?edge, ?s, ?p, ?o)
	->
	(:graph rvz:hasEdge ?edge)
	(?edge :predicate ?p)
	(:graph rvz:hasNode ?s)
	(:graph rvz:hasNode ?o)
	(?edge rvz:hasSource ?s)
	(?edge rvz:hasTarget ?o)
	]

## class formatting

    [block-formatting:
	(:graph rvz:hasNode ?x)
	(?x rdf:type imf:Block)
	shortvalue(?x ?label)
	->
	(?x rvz-a:label  ?label)
	(?x rvz-a:shape  "rectangle")
	//# (?x rvz-a:height ".4")
	//# (?x rvz-a:width  ".9")
	]

    [terminal-formatting:
	(:graph rvz:hasNode ?x)
	(?x rdf:type imf:Terminal)
	->
	(?x rvz-a:label  "") //# drop label
	(?x rvz-a:shape  "square")
	(?x rvz-a:height ".1")
	(?x rvz-a:width  ".1")
	]

    [connectionpoint-formatting:
	(:graph rvz:hasNode ?x)
	(?x rdf:type imf:ConnectionPoint)
	->
	(?x rvz-a:label  "") //# drop label
	(?x rvz-a:shape  "circle")
	(?x rvz-a:height ".3")
	(?x rvz-a:width  ".3")
	]

## property formatting

    [hasTerminal-formatting:
	(:graph rvz:hasEdge ?x)
	(?x :predicate imf:hasTerminal)
	->
	(?x rvz-a:arrowhead "none")
	(?x rvz-a:dir "forward")
	]



### EDGE FORMATTING

# constraint=false, see https://graphviz.org/docs/attrs/constraint/
    [imf:no-constraint:
	(?edge :predicate ?p)
	equalssome(?p, imf:hasTerminal, imf:connectedTo)
	->
	// (?edge rvz-a:constraint "false")
	]

    [edge-attribute
	(:graph rvz:hasEdge ?edge)
	(?edge :predicate ?p)
	(?p ?rvza ?value)
	namespace(?rvza, "http://rdfvizler.dyreriket.xyz/vocabulary/attribute#")
	->
	(?edge ?rvza ?value)
	]

    [node-attribute
	(:graph rvz:hasNode ?node)
	(?node rdf:type ?class)
	(?class ?rvza ?value)
	namespace(?rvza, "http://rdfvizler.dyreriket.xyz/vocabulary/attribute#")
	->
	(?node ?rvza ?value)
	]
#+END_SRC

#+RESULTS:
#+begin_example
@prefix xsd:	<http://www.w3.org/2001/XMLSchema#> .
@prefix rdf:	<http://www.w3.org/1999/02/22-rdf-syntax-ns#> .
@prefix rdfs:	<http://www.w3.org/2000/01/rdf-schema#> .
@prefix owl:    <http://www.w3.org/2002/07/owl#> .
@prefix sh:	<http://www.w3.org/ns/shacl#> .

@prefix dc:	<http://purl.org/dc/elements/1.1/> .
@prefix foaf:   <http://xmlns.com/foaf/0.1/> .
@prefix pav:	<http://purl.org/pav/> .
@prefix skos:	<http://www.w3.org/2004/02/skos/core#> .
@prefix vann:   <http://purl.org/vocab/vann/> .
@prefix vs:     <http://www.w3.org/2003/06/sw-vocab-status/ns#> .

@prefix ex:	<http://example.com#> .

@prefix imf:	   <http://ns.imfid.org/imf#> .
@prefix pca-plm:   <http://rds.posccaesar.org/ontology/plm/rdl/> .

@prefix ottr:        <http://ns.ottr.xyz/0.4/> .

@prefix o-rdf:       <http://tpl.ottr.xyz/rdf/0.1/> .
@prefix o-rdfs:      <http://tpl.ottr.xyz/rdfs/0.2/> .
@prefix o-owl-ax:    <http://tpl.ottr.xyz/owl/axiom/0.1/> .
@prefix o-owl-ma:    <http://tpl.ottr.xyz/owl/macro/0.1/> .
@prefix o-owl-rstr:  <http://tpl.ottr.xyz/owl/restriction/0.1/> .
@prefix o-owl-dec:   <http://tpl.ottr.xyz/owl/declaration/0.1/> .

@prefix o-imf:	     <http://ns.imfid.org/templates/> .
@prefix o-imf-t-s:   <http://ns.imfid.org/templates/type/shacl/> .
@prefix o-imf-t-o:   <http://ns.imfid.org/templates/type/owl/> .
@prefix o-imf-d:     <http://ns.imfid.org/templates/data/> .
@prefix rvz:  <http://rdfvizler.dyreriket.xyz/vocabulary/core#> .
@prefix rvz-a: <http://rdfvizler.dyreriket.xyz/vocabulary/attribute#> .
@prefix rvz-n: <http://rdfvizler.dyreriket.xyz/vocabulary/attribute-default-node#> .
@prefix rvz-e: <http://rdfvizler.dyreriket.xyz/vocabulary/attribute-default-edge#> .
@prefix :      <urn:temp#>

### GRAPH default settings
    [init:
	->
	(:graph rdf:type rvz:RootGraph)
	(:graph rdf:type rvz:DiGraph)
	(:graph rvz-a:rankdir "LR")
	//# (:graph rvz-a:nodesep "1")
	//# (:graph rvz-a:ranksep "1")
	(:graph rvz-a:center "true")
	(:graph rvz-a:overlap "true")
	//# (:graph rvz-a:splines "ortho")
	//# node defaults
	(:graph rvz-n:fontname "Arial")
	(:graph rvz-n:fontsize "11px")
	(:graph rvz-n:fixedsize "true")
	//# edge defaults
	(:graph rvz-e:fontname "Arial")
	(:graph rvz-e:fontsize "11px")
	]


    [classes:
	(?s rdf:type ?type)
	equalssome(?type, imf:Block imf:Terminal imf:ConnectionPoint)
	->
	(:graph rvz:hasNode ?s)
	]


    [triples:
	(?s ?p ?o)
	equalssome(?p, imf:hasPart, imf:hasTerminal, imf:connectedTo, imf:R)
	makeSkolem(?edge, ?s, ?p, ?o)
	->
	(:graph rvz:hasEdge ?edge)
	(?edge :predicate ?p)
	(:graph rvz:hasNode ?s)
	(:graph rvz:hasNode ?o)
	(?edge rvz:hasSource ?s)
	(?edge rvz:hasTarget ?o)
	]

## class formatting

    [block-formatting:
	(:graph rvz:hasNode ?x)
	(?x rdf:type imf:Block)
	shortvalue(?x ?label)
	->
	(?x rvz-a:label  ?label)
	(?x rvz-a:shape  "rectangle")
	//# (?x rvz-a:height ".4")
	//# (?x rvz-a:width  ".9")
	]

    [terminal-formatting:
	(:graph rvz:hasNode ?x)
	(?x rdf:type imf:Terminal)
	->
	(?x rvz-a:label  "")
	(?x rvz-a:shape  "square")
	(?x rvz-a:height ".1")
	(?x rvz-a:width  ".1")
	]

    [connectionpoint-formatting:
	(:graph rvz:hasNode ?x)
	(?x rdf:type imf:ConnectionPoint)
	->
	(?x rvz-a:label  "")
	(?x rvz-a:shape  "circle")
	(?x rvz-a:height ".3")
	(?x rvz-a:width  ".3")
	]

## property formatting

    [hasTerminal-formatting:
	(:graph rvz:hasEdge ?x)
	(?x :predicate imf:hasTerminal)
	->
	(?x rvz-a:arrowhead "none")
	(?x rvz-a:dir "forward")
	]



### EDGE FORMATTING

# constraint=false, see https://graphviz.org/docs/attrs/constraint/
    [imf:no-constraint:
	(?edge :predicate ?p)
	equalssome(?p, imf:hasTerminal, imf:connectedTo)
	->
	// (?edge rvz-a:constraint "false")
	]

    [edge-attribute
	(:graph rvz:hasEdge ?edge)
	(?edge :predicate ?p)
	(?p ?rvza ?value)
	namespace(?rvza, "http://rdfvizler.dyreriket.xyz/vocabulary/attribute#")
	->
	(?edge ?rvza ?value)
	]

    [node-attribute
	(:graph rvz:hasNode ?node)
	(?node rdf:type ?class)
	(?class ?rvza ?value)
	namespace(?rvza, "http://rdfvizler.dyreriket.xyz/vocabulary/attribute#")
	->
	(?node ?rvza ?value)
	]
#+end_example

*** py_list_iris

#+NAME: py_list_iris
#+BEGIN_SRC python :noweb yes :var datafile="out/owl/imf-ontology.owl.ttl" :results raw
<<py_common_functions>>

iris = list(filter(lambda x: x.startswith("http://ns.imfid.org/imf#"), getAllIRIs(datafile)))
iris = ['<' + str(i) + '>' for i in iris]
iris.sort()

return ', '.join(iris)
#+END_SRC

#+RESULTS: py_list_iris
<http://ns.imfid.org/imf#>, <http://ns.imfid.org/imf#Aspect>, <http://ns.imfid.org/imf#AspectElement>, <http://ns.imfid.org/imf#Attribute>, <http://ns.imfid.org/imf#AttributeQualifier>, <http://ns.imfid.org/imf#Block>, <http://ns.imfid.org/imf#BreakdownPoint>, <http://ns.imfid.org/imf#ConnectionPoint>, <http://ns.imfid.org/imf#Element>, <http://ns.imfid.org/imf#FunctionBlock>, <http://ns.imfid.org/imf#FunctionElement>, <http://ns.imfid.org/imf#FunctionTerminal>, <http://ns.imfid.org/imf#IMFOntology>, <http://ns.imfid.org/imf#InputTerminal>, <http://ns.imfid.org/imf#InstalledBlock>, <http://ns.imfid.org/imf#InstalledElement>, <http://ns.imfid.org/imf#InstalledTerminal>, <http://ns.imfid.org/imf#LocationBlock>, <http://ns.imfid.org/imf#LocationElement>, <http://ns.imfid.org/imf#LocationTerminal>, <http://ns.imfid.org/imf#Model>, <http://ns.imfid.org/imf#OutputTerminal>, <http://ns.imfid.org/imf#ProductBlock>, <http://ns.imfid.org/imf#ProductElement>, <http://ns.imfid.org/imf#ProductTerminal>, <http://ns.imfid.org/imf#ProvenanceQualifier>, <http://ns.imfid.org/imf#RangeQualifier>, <http://ns.imfid.org/imf#RegularityQualifier>, <http://ns.imfid.org/imf#ScopeQualifier>, <http://ns.imfid.org/imf#Terminal>, <http://ns.imfid.org/imf#TerminalQualifier>, <http://ns.imfid.org/imf#absoluteQualifier>, <http://ns.imfid.org/imf#asFunction>, <http://ns.imfid.org/imf#asInstalled>, <http://ns.imfid.org/imf#asLocation>, <http://ns.imfid.org/imf#asProduct>, <http://ns.imfid.org/imf#associativeRelation>, <http://ns.imfid.org/imf#averageQualifier>, <http://ns.imfid.org/imf#calculatedQualifier>, <http://ns.imfid.org/imf#classifier>, <http://ns.imfid.org/imf#color>, <http://ns.imfid.org/imf#connectedTo>, <http://ns.imfid.org/imf#continuousQualifier>, <http://ns.imfid.org/imf#designQualifier>, <http://ns.imfid.org/imf#externalReference>, <http://ns.imfid.org/imf#functionAspect>, <http://ns.imfid.org/imf#hasAspect>, <http://ns.imfid.org/imf#hasAttribute>, <http://ns.imfid.org/imf#hasAttributeQualifier>, <http://ns.imfid.org/imf#hasElement>, <http://ns.imfid.org/imf#hasInputTerminal>, <http://ns.imfid.org/imf#hasOutputTerminal>, <http://ns.imfid.org/imf#hasPart>, <http://ns.imfid.org/imf#hasTerminal>, <http://ns.imfid.org/imf#hasTerminalQualifier>, <http://ns.imfid.org/imf#hierachicalRelation>, <http://ns.imfid.org/imf#hierarchicalRelation>, <http://ns.imfid.org/imf#inputFlow>, <http://ns.imfid.org/imf#installedAspect>, <http://ns.imfid.org/imf#interAspectRelation>, <http://ns.imfid.org/imf#intraAspectRelation>, <http://ns.imfid.org/imf#locationAspect>, <http://ns.imfid.org/imf#maximumQualifier>, <http://ns.imfid.org/imf#measuredQualifier>, <http://ns.imfid.org/imf#medium>, <http://ns.imfid.org/imf#minimumQualifier>, <http://ns.imfid.org/imf#nominalQualifier>, <http://ns.imfid.org/imf#normalQualifier>, <http://ns.imfid.org/imf#operatingQualifier>, <http://ns.imfid.org/imf#outputFlow>, <http://ns.imfid.org/imf#partOf>, <http://ns.imfid.org/imf#predicate>, <http://ns.imfid.org/imf#prefix>, <http://ns.imfid.org/imf#productAspect>, <http://ns.imfid.org/imf#specifiedQualifier>, <http://ns.imfid.org/imf#symbol>, <http://ns.imfid.org/imf#theConnected>, <http://ns.imfid.org/imf#theInput>, <http://ns.imfid.org/imf#theOutput>, <http://ns.imfid.org/imf#thePart>, <http://ns.imfid.org/imf#theWhole>, <http://ns.imfid.org/imf#uom>, <http://ns.imfid.org/imf#value>

*** py_iri_rdf_diff

Simple diff of 2 RDF files, output list of changed IRIs.

#+NAME: py_iri_rdf_diff
#+BEGIN_SRC python :noweb yes :var v2="out/owl/imf-ontology.owl.ttl" :var v1="https://ns.imfid.org/20221118/imf-vocabulary.owl.ttl" :results raw

<<py_common_functions>>

pGraph = rdflib.Graph()
pGraph.parse(v2, format="ttl")

def prepare(input):
  rL = list(input)
  rL2 = list(filter(lambda x: x.startswith("http://ns.imfid.org"), rL))
  rL2.sort()
  return list(map(pGraph.namespace_manager.qname, rL2))

iri1 = getAllIRIs(v1)
iri2 = getAllIRIs(v2)

inboth = iri1 & iri2
added = iri2 - iri1
deleted = iri1 - iri2

output = ""

output += " - IRIs present in both versions :: " + ", ".join(prepare(inboth)) + "\n\n"
output += " - IRIs present only in this version :: " + ", ".join(prepare(added)) + "\n\n"
output += " - IRIs present only in previous version :: " + ", ".join(prepare(deleted))

return output
#+END_SRC

#+RESULTS: py_iri_rdf_diff
 - IRIs present in both versions :: ns1:imf, imf:Aspect, imf:AspectElement, imf:Block, imf:FunctionBlock, imf:FunctionTerminal, imf:InputTerminal, imf:InstalledBlock, imf:InstalledTerminal, imf:LocationBlock, imf:LocationTerminal, imf:OutputTerminal, imf:ProductBlock, imf:ProductTerminal, imf:Terminal, imf:associativeRelation, imf:color, imf:hasAspect, imf:hasInputTerminal, imf:hasOutputTerminal, imf:hasPart, imf:hasTerminal, imf:hierarchicalRelation, imf:interAspectRelation, imf:intraAspectRelation, imf:prefix, imf:theInput, imf:theOutput

 - IRIs present only in this version :: ns2:imf, imf:, imf:Attribute, imf:AttributeQualifier, imf:BreakdownPoint, imf:ConnectionPoint, imf:Element, imf:FunctionElement, imf:InstalledElement, imf:LocationElement, imf:ProductElement, imf:ProvenanceQualifier, imf:RangeQualifier, imf:RegularityQualifier, imf:ScopeQualifier, imf:TerminalQualifier, imf:absoluteQualifier, imf:asFunction, imf:asInstalled, imf:asLocation, imf:asProduct, imf:averageQualifier, imf:calculatedQualifier, imf:classifier, imf:connectedTo, imf:continuousQualifier, imf:designQualifier, imf:externalReference, imf:functionAspect, imf:hasAttribute, imf:hasAttributeQualifier, imf:hasTerminalQualifier, imf:hierachicalRelation, imf:inputFlow, imf:installedAspect, imf:locationAspect, imf:maximumQualifier, imf:measuredQualifier, imf:medium, imf:minimumQualifier, imf:nominalQualifier, imf:normalQualifier, imf:operatingQualifier, imf:outputFlow, imf:partOf, imf:productAspect, imf:property, imf:specifiedQualifier, imf:symbol, imf:theConnected, imf:thePart, imf:theWhole, imf:uom, imf:value

 - IRIs present only in previous version :: ns3:imf-vocabulary, imf:FunctionAspect, imf:FunctionAspectElement, imf:FunctionInterfacePoint, imf:InstalledAspect, imf:InstalledAspectElement, imf:InstalledInterfacePoint, imf:InterAspectRelation, imf:InterfacePoint, imf:LocationAspect, imf:LocationAspectElement, imf:LocationInterfacePoint, imf:ProductAspect, imf:ProductAspectElement, imf:ProductInterfacePoint, imf:System, imf:SystemElement, imf:fulfilledBy, imf:fulfills, imf:isConnectedTo, imf:isPartOf, imf:memberOf

*** Lists                                                          :noexport:

#+NAME: prefixlist
 - xsd :: http://www.w3.org/2001/XMLSchema#
 - rdf :: http://www.w3.org/1999/02/22-rdf-syntax-ns#
 - rdfs :: http://www.w3.org/2000/01/rdf-schema#
 - owl :: http://www.w3.org/2002/07/owl#
 - skos :: http://www.w3.org/2004/02/skos/core#
 - imf :: http://ns.imfid.org/imf#

#+NAME: py_functions
#+BEGIN_SRC python

## converts a org-mode definition list into a python dict
def deflist2dict(list):
  newlist={}
  for row in list:
    newrow = row[0].split(' :: ')
    newlist[newrow[0]] = newrow[1]

  return newlist

from rdflib import Graph, Namespace, URIRef

def getURIRef(prefixdict, qname):
  prefix, localname = qname.split(':')
  return URIRef(prefixdict[prefix] + localname)

def getGraph(prefixdict):
  graph = Graph()
  for key, value in prefixdict.items():
    ns = Namespace(value)
    graph.bind(key, ns)
  return graph
#+END_SRC

#+RESULTS: py_functions
: None

#+NAME: py_prefixlist2ttl
#+BEGIN_SRC python :noweb yes :var list=prefixlist
<<py_functions>>

output = ""
for key, value in deflist2dict(list).items():
  output += '@prefix ' + key + ':\t<' + value + '> .\n'
return output
#+END_SRC

#+RESULTS: py_prefixlist2ttl
: @prefix xsd:	<http://www.w3.org/2001/XMLSchema#> .
: @prefix rdf:	<http://www.w3.org/1999/02/22-rdf-syntax-ns#> .
: @prefix rdfs:	<http://www.w3.org/2000/01/rdf-schema#> .
: @prefix skos:	<http://www.w3.org/2004/02/skos/core#> .
: @prefix imf:	<http://ns.imfid.org/imf#> .

#+CALL: py_prefixlist2ttl[:wrap src ttl](list=prefixlist)
**** IMF ontology

Check that the IMF type is consistent using an OWL reasoner.

#+BEGIN_SRC sh :results output
java -jar bin/HermiT.jar -l -k -U example/pumpingFunctionType.owl.ttl
#+END_SRC

#+RESULTS:
: http://www.w3.org/2002/07/owl#Thing is satisfiable.
: Classes equivalent to 'owl:Nothing':
:	owl:Nothing

**** ... the IMF ontology

Check that the IMF instance data is not inconsistent using an OWL reasoner.

#+BEGIN_SRC sh :results output
java -jar bin/HermiT.jar -l -k -U example/pumpingFunctionPrototype.ttl
#+END_SRC

#+RESULTS:
: http://www.w3.org/2002/07/owl#Thing is satisfiable.
: Classes equivalent to 'owl:Nothing':
:	owl:Nothing
